---
kind: method
id: M:Autodesk.Revit.DB.LinePattern.#ctor
source: html/3e3fe969-2758-ac8d-eaf5-fe2472553b31.htm
---
# Autodesk.Revit.DB.LinePattern.#ctor Method

Creates a simple line pattern.

## Syntax (C#)
```csharp
public LinePattern()
```